export class Position {
    // 主页右下角数字坐标
    public static NumberPath = [
        {x: 1421, y: 691}, //1
        {x: 1563, y: 691},//2
        {x: 1706, y: 691},//3
        {x: 1421, y: 805},//4
        {x: 1563, y: 805},//5
        {x: 1706, y: 805},//6
        {x: 1421, y: 915},//7
        {x: 1563, y: 915},//8
        {x: 1706, y: 915},//9
        {x: 1417, y: 1021}, //0
        {x: 1632, y: 1033}, // .
    ];

    public static returnAuthorization = [
        {x: 744, y: 595}, //1
        {x: 888, y: 595},//2
        {x: 1031, y: 595},//3
        {x: 744, y: 705},//4
        {x: 888, y: 705},//5
        {x: 1031, y: 705},//6
        {x: 744, y: 815},//7
        {x: 888, y: 815},//8
        {x: 1031, y: 815},//9
        {x: 956, y: 922}, //0
        {x: 741, y: 929}, // .
    ];

    // 支付供应商位置，从左往右，从上往下
    public static pay = [
        {x: 484, y: 165}, //1
        {x: 879, y: 165},//2
        {x: 480, y: 311},//3
        {x: 879, y: 311},//4
        {x: 480, y: 445},//5
        {x: 879, y: 453},//6
    ];

    // 退出账号关联坐标
    public static exit_account = [
        {x: 1693, y: 230},//退出账号按钮坐标
        {x: 948, y: 933},//确定
        {x: 948, y: 1025},//取消
    ];

    // 关机按钮坐标
    public static shut_down = {x: 1805, y: 227};
}
